In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("sales_train_v2.csv", index_col=0)
data.head()

            date_block_num  shop_id  item_id  item_price  item_cnt_day
date
02.01.2013               0       59    22154      999.00           1.0
03.01.2013               0       25     2552      899.00           1.0
05.01.2013               0       25     2552      899.00          -1.0
06.01.2013               0       25     2554     1709.05           1.0
15.01.2013               0       25     2555     1099.00           1.0

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2935849 entries, 02.01.2013 to 03.10.2015
Data columns (total 5 columns):
 #   Column          Dtype
---  ------          -----
 0   date_block_num  int64
 1   shop_id         int64
 2   item_id         int64
 3   item_price      float64
 4   item_cnt_day    float64
dtypes: float64(2), int64(3)
memory usage: 134.4+ MB

In [5]:
data['item_id'].value_counts()[:3]

20949    31340
5822      9408
17717     9067
Name: item_id, dtype: int64

In [6]:
total_std=np.std(data['item_price'])
total_std

1729.799336113404

In [7]:
top3=data[(data['item_id']==20949) | (data['item_id']==5822) | (data['item_id']==17717)]
top3

            date_block_num  shop_id  item_id  item_price  item_cnt_day
date
03.01.2013               0       25     5822       999.0           1.0
10.01.2013               0       25     5822       999.0           1.0
13.01.2013               0       25     5822       999.0           2.0
16.01.2013               0       25     5822       999.0           2.0
21.01.2013               0       25     5822       999.0           1.0
...                    ...      ...      ...         ...           ...
15.10.2015              33       25     5822      1149.0           1.0
16.10.2015              33       25     5822      1149.0           1.0
20.10.2015              33       25     5822      1149.0           1.0
25.10.2015              33       25     5822      1149.0           1.0
28.10.2015              33       25     5822      1149.0           2.0

[49815 rows x 5 columns]

In [8]:
top3_std=np.std(top3['item_price'])
top3_std

627.997139509638

In [9]:
print(total_std-top3_std)

1101.8021966037659